package com.javarush.test.level06.lesson11.bonus03;

import java.io.BufferedReader;
import java.io.InputStreamReader;
import java.util.Arrays;

/* Задача по алгоритмам
Задача: Написать программу, которая вводит с клавиатуры 5 чисел и выводит их в возрастающем порядке.
Пример ввода:
3
2
15
6
17
Пример вывода:
2
3
6
15
17
*/

public class Solution
{
    public static void main(String[] args) throws Exception
    {
        BufferedReader reader = new BufferedReader(new InputStreamReader(System.in));
        int [] numbers = new int[5];
        for (int a = 0; a < numbers.length;a ++)
        {
            numbers[a] = Integer.parseInt(reader.readLine());
        }
        Arrays.sort(numbers);
        for (int b = 0; b < numbers.length; b ++)
        {
            System.out.println(numbers[b]);
        }


      //Напишите тут ваш код
    }
}
